EH_OpenFOAM/tests/BoxReact/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue phis 0.0
    volScalarFieldValue phifs 0.0
);

regions
(
    boxToCell
    {
        box (-0.0135 -0.0135 0.0) (0.0135 0.0135 0.082);
        fieldValues
        (
            volScalarFieldValue phis 0.034
            volScalarFieldValue phifs 0.014
        );
    }
);


// ************************************************************************* //
